//　ボード.cpp（処理の部分を書く）
#include"Board.h";


//----------------------------------
//  初期化処理
//----------------------------------
void Board::Init() {

	Line_x=160;
	Line_y = 160;

}
//----------------------------------
//  更新処理
//----------------------------------
void Board::Update() {

}
//----------------------------------
//  描画処理
//----------------------------------
void Board::Render() {

	//	盤の描画
	DrawLine(Line_x,0, Line_x+160,0,GetColor(255,255,255));		//	X軸の線
	DrawLine(Line_y, 0, 0, Line_y+160, GetColor(255, 255, 255));	//	Y軸の線


}
//----------------------------------
//	終了処理
//----------------------------------
void Board::Exit() {

}