//　ボード.cpp（処理の部分を書く）
#include"Board.h";

#include"Mouse.h"


//----------------------------------
//  初期化処理
//----------------------------------
void Board::Init() {

	Line_x=160;
	Line_y = 160;

	//	1マス(200*200)	
	cell_x = mouse.mouse_pos.x/ 200;
	cell_y = mouse.mouse_pos.y / 200;

	cell_num = (cell_y - 1) * 4 + cell_x;


}
//----------------------------------
//  更新処理
//----------------------------------
void Board::Update() {

}
//----------------------------------
//  描画処理
//----------------------------------
void Board::Render() {

	//	盤の描画
	DrawLine(Line_x,0, Line_x+160,0,GetColor(255,255,255));		//	X軸の線
	DrawLine(Line_y, 0, 0, Line_y+160, GetColor(255, 255, 255));	//	Y軸の線


}
//----------------------------------
//	終了処理
//----------------------------------
void Board::Exit() {

}